In [1]:
import pandas as pd
import numpy as np
print(pd.__version__)

0.25.1

In [2]:
aa = np.array([1,2,3,4,5,6,7,8,9])
aaSeries = pd.Series(aa)
aa

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
aaSeries

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32

In [4]:
aaDataFrame = pd.DataFrame(aa, columns=['Number'])
aaDataFrame

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [5]:
abDataFrame = pd.DataFrame([[1,2],[3,4],[4,5]], columns=['A','B'])
abDataFrame

   A  B
0  1  2
1  3  4
2  4  5

In [6]:
ac = [9,2,5,3,4,5,7,4,3,5,7]
acSeries = pd.Series((ac), 
            index=['a','b','c','d','e','f','g','h','i','j','k'],
            name = 'Test')
ac

[9, 2, 5, 3, 4, 5, 7, 4, 3, 5, 7]

In [7]:
acSeries

a    9
b    2
c    5
d    3
e    4
f    5
g    7
h    4
i    3
j    5
k    7
Name: Test, dtype: int64

In [8]:
type(acSeries)

pandas.core.series.Series

In [9]:
#Calling index value
acSeries[0::2]

a    9
c    5
e    4
g    7
i    3
k    7
Name: Test, dtype: int64

In [10]:
acSeries = pd.Series(
        data = {'a': 2, 'b': 3}, 
#         index=['a','b','c','d','e','f','g','h','i','j','k'],
        name = 'Test 2')
acSeries

a    2
b    3
Name: Test 2, dtype: int64

In [11]:
#DATA FRAME
ad = [1,2,3,4,5,6,7,8,9,10]
df = pd.DataFrame(ad, columns=['Number'])
df

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9
9      10

In [12]:
#Baris, Kolom
df.shape

(10, 1)

In [13]:
row, col = df.shape
row, col

(10, 1)

In [14]:
ae = [1,3,5,7,9]
af = [2,4,6,8,10]
df = pd.DataFrame([ae,af], index = ['odd','even'])
df_Tranpose = df.T
df_Tranpose

   odd  even
0    1     2
1    3     4
2    5     6
3    7     8
4    9    10

In [15]:
df

      0  1  2  3   4
odd   1  3  5  7   9
even  2  4  6  8  10

In [16]:
df = pd.DataFrame()
df['odd'] = ae
df['even'] = af

In [17]:
ag = [[1,2],[3,4],[5,6],[7,8],[9,10]]
df = pd.DataFrame(ag)
df

   0   1
0  1   2
1  3   4
2  5   6
3  7   8
4  9  10

In [18]:
#DATA FRAME
ah = [1,3,5,7,9] 
ai = [2,4,6,8,10]
aj = list('INATS')

df = pd.DataFrame()
df['X'] = ah
df['Y'] = ai
df['Z'] = aj

In [19]:
df

   X   Y  Z
0  1   2  I
1  3   4  N
2  5   6  A
3  7   8  T
4  9  10  S

In [20]:
data0 = [
    ['Inatsya', 'Nganjuk', 'Wirausaha', 'Taken','3.68'],
    ['Rachmad', 'Mojokerto', 'Data Engineer', 'Taken', '3.46'],
    ['Ueda', 'Sidoarjo', 'Mahasiswa', 'Jomblo'],
]
dfData = pd.DataFrame(data0, columns = ['Name','City','Job','Status','IPK'])
dfData

      Name       City            Job  Status   IPK
0  Inatsya    Nganjuk      Wirausaha   Taken  3.68
1  Rachmad  Mojokerto  Data Engineer   Taken  3.46
2     Ueda   Sidoarjo      Mahasiswa  Jomblo  None

In [21]:
dfData_T = dfData.T
dfData_T

                0              1          2
Name      Inatsya        Rachmad       Ueda
City      Nganjuk      Mojokerto   Sidoarjo
Job     Wirausaha  Data Engineer  Mahasiswa
Status      Taken          Taken     Jomblo
IPK          3.68           3.46       None

In [22]:
data1 = {
    'x': [123,321,213],
    'y': [234,432,324],
    'z': [345,543,435]
}
df = pd.DataFrame(data1)
df

     x    y    z
0  123  234  345
1  321  432  543
2  213  324  435

In [23]:
x = [20,21,33,7,1,3,2,4]
x = pd.Series(x, name = 'Test 0')
y = [12,89,9,1,2,3,50,41]
y = pd.Series(y, name = 'Test 1')
df = pd.DataFrame([x,y])
df

         0   1   2  3  4  5   6   7
Test 0  20  21  33  7  1  3   2   4
Test 1  12  89   9  1  2  3  50  41

In [24]:
df_t = df.T
df_t

   Test 0  Test 1
0      20      12
1      21      89
2      33       9
3       7       1
4       1       2
5       3       3
6       2      50
7       4      41

In [25]:
df = pd.DataFrame({
    x.name : x,
    y.name : y
})
df

   Test 0  Test 1
0      20      12
1      21      89
2      33       9
3       7       1
4       1       2
5       3       3
6       2      50
7       4      41

In [26]:
df = pd.DataFrame({
    'A': np.arange(20,26),
    'B': [32,4,13,6,7,1],
    'C': 99,
    'D': np.ones(6, dtype='int64'),
    'E': np.random.rand(6)
})
df

    A   B   C  D         E
0  20  32  99  1  0.766468
1  21   4  99  1  0.413172
2  22  13  99  1  0.345616
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905
5  25   1  99  1  0.252741

In [27]:
df.head()

    A   B   C  D         E
0  20  32  99  1  0.766468
1  21   4  99  1  0.413172
2  22  13  99  1  0.345616
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905

In [28]:
df.head(3)

    A   B   C  D         E
0  20  32  99  1  0.766468
1  21   4  99  1  0.413172
2  22  13  99  1  0.345616

In [29]:
df.tail()

    A   B   C  D         E
1  21   4  99  1  0.413172
2  22  13  99  1  0.345616
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905
5  25   1  99  1  0.252741

In [30]:
df.tail(2)

    A  B   C  D         E
4  24  7  99  1  0.392905
5  25  1  99  1  0.252741

In [31]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [32]:
list(df.index)

[0, 1, 2, 3, 4, 5]

In [33]:
list(df.columns)[1]

'B'

In [34]:
df.describe()

               A          B     C    D         E
count   6.000000   6.000000   6.0  6.0  6.000000
mean   22.500000  10.500000  99.0  1.0  0.443842
std     1.870829  11.256109   0.0  0.0  0.176705
min    20.000000   1.000000  99.0  1.0  0.252741
25%    21.250000   4.500000  99.0  1.0  0.357438
50%    22.500000   6.500000  99.0  1.0  0.403039
75%    23.750000  11.500000  99.0  1.0  0.472405
max    25.000000  32.000000  99.0  1.0  0.766468

In [35]:
df['C'].describe()

count     6.0
mean     99.0
std       0.0
min      99.0
25%      99.0
50%      99.0
75%      99.0
max      99.0
Name: C, dtype: float64

In [36]:
#Mengurutkan index baris
df.sort_index(ascending=False, axis=0)

    A   B   C  D         E
5  25   1  99  1  0.252741
4  24   7  99  1  0.392905
3  23   6  99  1  0.492150
2  22  13  99  1  0.345616
1  21   4  99  1  0.413172
0  20  32  99  1  0.766468

In [37]:
#Assign value ke Data Frame
df.sort_index(ascending=False, axis=1) #inplace = True)

          E  D   C   B   A
0  0.766468  1  99  32  20
1  0.413172  1  99   4  21
2  0.345616  1  99  13  22
3  0.492150  1  99   6  23
4  0.392905  1  99   7  24
5  0.252741  1  99   1  25

In [38]:
df

    A   B   C  D         E
0  20  32  99  1  0.766468
1  21   4  99  1  0.413172
2  22  13  99  1  0.345616
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905
5  25   1  99  1  0.252741

In [39]:
df.sort_values(by='B')

    A   B   C  D         E
5  25   1  99  1  0.252741
1  21   4  99  1  0.413172
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905
2  22  13  99  1  0.345616
0  20  32  99  1  0.766468

In [40]:
df.sort_values(by='A', ascending=False)

    A   B   C  D         E
5  25   1  99  1  0.252741
4  24   7  99  1  0.392905
3  23   6  99  1  0.492150
2  22  13  99  1  0.345616
1  21   4  99  1  0.413172
0  20  32  99  1  0.766468

In [41]:
df.sort_values(by=['C','D','B'],ascending=[True,True,True])

    A   B   C  D         E
5  25   1  99  1  0.252741
1  21   4  99  1  0.413172
3  23   6  99  1  0.492150
4  24   7  99  1  0.392905
2  22  13  99  1  0.345616
0  20  32  99  1  0.766468

In [42]:
df[['A','B','E']]

    A   B         E
0  20  32  0.766468
1  21   4  0.413172
2  22  13  0.345616
3  23   6  0.492150
4  24   7  0.392905
5  25   1  0.252741

In [43]:
#loc baris
df.loc[0]

A    20.000000
B    32.000000
C    99.000000
D     1.000000
E     0.766468
Name: 0, dtype: float64

In [44]:
#loc baris, kolom
df.loc[0,'A']

20

In [45]:
#loc baris, kolom
df.loc[0:2,'A']

0    20
1    21
2    22
Name: A, dtype: int32

In [46]:
#loc baris, nama kolom
df.loc[1:4,['B','E']].sort_values(by=['B','E'], ascending=[True,False])

    B         E
1   4  0.413172
3   6  0.492150
4   7  0.392905
2  13  0.345616

In [47]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [48]:
df.index = list('ABCDEF')
df

    A   B   C  D         E
A  20  32  99  1  0.766468
B  21   4  99  1  0.413172
C  22  13  99  1  0.345616
D  23   6  99  1  0.492150
E  24   7  99  1  0.392905
F  25   1  99  1  0.252741

In [49]:
#iloc call by urutan index = int
df.loc['A','A']

20

In [50]:
df.iloc[0,4]

0.7664675246284544

In [51]:
df.iloc[1:3,2:4]

    C  D
B  99  1
C  99  1

In [53]:
df.columns = ['Usia','Rating','Netto','Bruto','Popularity']
df

   Usia  Rating  Netto  Bruto  Popularity
A    20      32     99      1    0.766468
B    21       4     99      1    0.413172
C    22      13     99      1    0.345616
D    23       6     99      1    0.492150
E    24       7     99      1    0.392905
F    25       1     99      1    0.252741

In [56]:
df.iloc[::2].sort_values(
    by = ['Usia', 'Popularity'],
    ascending = [False, True]
)[['Rating','Usia']]

   Rating  Usia
E       7    24
C      13    22
A      32    20

In [ ]:
# myDF = pd.read_csv(namafile)
# myDF = pd.read_excel(namafile)
# myDF = pd.read_json(namafile)